CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTA0 (number 50), SWO_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWO_CLK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWO_CLK_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWO_CLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA3 (number 53), SWO_DIO
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWO_DIO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWO_DIO_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWO_DIO_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA5 (number 55), RST
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_RST_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_RST_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_RST_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Basic(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */

/*! @name PORTE0 (number 1), SD_D_1
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_1_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE1 (number 2), SD_D_0
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_0_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE2 (number 3), SD_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_CLK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_CLK_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_CLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE3 (number 4), SD_CMD
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_CMD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_CMD_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_CMD_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE5 (number 8), SD_D_2
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_2_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE4 (number 7), SD_D_3
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_3_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_3_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE7 (number 10), BUTTON_DN
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_DN_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_DN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_DN_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_DN_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_DN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE8 (number 11), BUTTON_RT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_RT_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_RT_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_RT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_RT_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_RT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE9 (number 12), BUTTON_LF
  @{ */

