CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_OLED_RST_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_RST_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_OLED_RST_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_RST_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_OLED_RST_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD15 (number 144), OLED_D_C
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_OLED_D_C_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_D_C_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_OLED_D_C_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_D_C_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_OLED_D_C_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD12 (number 141), OLED_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_OLED_SCK_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_SCK_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_OLED_SCK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD13 (number 142), OLED_SOT
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_OLED_SOT_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_OLED_SOT_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_OLED_SOT_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE6 (number 9), SD_DTK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_SD_DTK_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_SD_DTK_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_DTK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_DTK_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_DTK_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC16 (number 123), CAM_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_RX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_RX_PIN 16U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC17 (number 124), CAM_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_TX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_TX_PIN 17U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD8 (number 137), IMU_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_IMU_SCL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_IMU_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_IMU_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD9 (number 138), IMU_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_IMU_SDA_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_IMU_SDA_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_IMU_SDA_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC1 (number 104), MOTOR_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_MOTOR_RA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_MOTOR_RA_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_MOTOR_RA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC2 (number 105), MOTOR_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_MOTOR_RB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_MOTOR_RB_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_MOTOR_RB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC3 (number 106), MOTOR_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_MOTOR_LA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_MOTOR_LA_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_MOTOR_LA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC4 (number 109), MOTOR_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_MOTOR_LB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_MOTOR_LB_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_MOTOR_LB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                         /* @} */

