CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTC19 (number 126), BEEP
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BEEP_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BEEP_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BEEP_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BEEP_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BEEP_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Digital(void);

/*! @name ADC0_SE16 (number 36), EMAG0
  @{ */
/* @} */

/*! @name ADC0_SE23 (number 38), EMAG1
  @{ */
/* @} */

/*! @name PORTE24 (number 45), EMAG2
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG2_PIN 24U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG2_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE25 (number 46), EMAG3
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG3_PIN 25U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG3_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA7 (number 59), EMAG4
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG4_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG4_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTA8 (number 60), EMAG5
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG5_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG5_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG5_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB2 (number 83), EMAG6
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG6_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG6_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG6_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB3 (number 84), EMAG7
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_ANALOG_EMAG7_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_ANALOG_EMAG7_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_ANALOG_EMAG7_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Analog(void);

#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 transmit data source select: LPUART0_TX pin */

/*! @name PORTA1 (number 51), UART_DBG_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_LPUART0_DBG_UART_DBG_RX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_LPUART0_DBG_UART_DBG_RX_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_LPUART0_DBG_UART_DBG_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTA2 (number 52), UART_DBG_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_LPUART0_DBG_UART_DBG_TX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_LPUART0_DBG_UART_DBG_TX_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_LPUART0_DBG_UART_DBG_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_LPUART0_DBG(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD6 (number 133), UART_WLAN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTD7 (number 136), UART_WLAN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_UART0_WLAN(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
